{
  "users": [
    {
      "id": "1",
      "username": "grantc802",
      "firstName": "Grant",
      "lastName": "Cummings",
      "birthday": "06/08/1997",
      "email": "grantcummings47@gmail.com",
      "favorites": [
        {
          "id": 843527,
          "title": "The Idea of You",
          "rating": 7.621,
          "overview": "40-year-old single mom Solène begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet."
        },
        {
          "id": 1051896,
          "title": "Arcadian",
          "rating": 6.338,
          "overview": "In a near future, normal life on Earth has been decimated. Paul and his two sons, Thomas and Joseph, have been living a half-life – tranquility by day and torment by night. Every night, after the sun sets, they face the unrelenting attacks of a mysterious and violent evil. One day, when Thomas doesn't return home before sundown, Paul must leave the safety of their fortified farm to find him. A nightmarish battle ensues that forces the family to execute a desperate plan to survive."
        },
        {
          "id": 934632,
          "title": "Rebel Moon - Part Two: The Scargiver",
          "rating": 6.125,
          "overview": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made."
        }
      ],
      "likes": [
        {
          "id": 845111,
          "title": "The Three Musketeers: Milady",
          "rating": 6.484,
          "overview": "D'Artagnan, on a quest to rescue the abducted Constance, runs into the mysterious Milady de Winter again. The tension between the Catholics and the Protestants finally escalates, as the king declares war — forcing the now four musketeers into battle. But as the war goes on, they are tested physically, mentally and emotionally."
        },
        {
          "id": 823464,
          "title": "Godzilla x Kong: The New Empire",
          "rating": 6.475,
          "overview": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own."
        },
        {
          "id": 934632,
          "title": "Rebel Moon - Part Two: The Scargiver",
          "rating": 6.125,
          "overview": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made."
        }
      ]
    },
    {
      "id": "2",
      "username": "test",
      "firstName": "Grant",
      "lastName": "Cummings",
      "birthday": "06/08/1997",
      "email": "grantcummings47@gmail.com",
      "favorites": [],
      "likes": [
        {
          "id": 251091,
          "title": "Star Wars: Tales of the Empire",
          "rating": 7.92,
          "overview": "A journey into the fearsome Galactic Empire through the eyes of two warriors on divergent paths."
        }
      ]
    }
  ]
}